---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.GeometryCreationUtilities
source: html/28337984-cc15-72d7-f305-fafcac75d695.htm
---
# GeometryCreationUtilities Members

Creates a solid by blending two closed curve loops lying in non-coincident planes.